//PLCYEXTR JOB (ALB,DWH),'POLICY MASTER XTRCT',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*--------------------------------------------------------------------
//* NIGHTLY POLICY MASTER EXTRACT FROM LEGACY_PAS (VSAM) TO FLAT FILE
//* OUTPUT LANDS ON /interface/inbound/plcymstr via NDM (CONNECT:DIRECT)
//* DOWNSTREAM: INFA wf_POLICY_MASTER_DAILY  (03:15 GMT)
//*             TERADATA 04_stg_policy_360.bteq (04:30 GMT)
//* ON-CALL: GROUP-MAINFRAME-SVCS (ROTA IN SERVICE-NOW, MOSTLY STALE)
//*--------------------------------------------------------------------
//STEP010  EXEC PGM=PLCYX010,REGION=4M
//STEPLIB  DD DSN=ALB.PROD.LOADLIB,DISP=SHR
//PLCYVSAM DD DSN=ALB.PAS.PLCYMSTR.KSDS,DISP=SHR
//PLCYOUT  DD DSN=ALB.DWH.PLCYMSTR.DAILY(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(50,10)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//SYSOUT   DD SYSOUT=*
//*
//STEP020  EXEC PGM=IDCAMS
//* REPRO A SECOND COPY FOR ACTUARIAL - THEY INSISTED ON THEIR OWN
//* FEED IN 2014 RATHER THAN READ THE DWH. NOW BOTH EXIST. (CR-2014-311)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(PLCYIN) OUTFILE(ACTOUT)
/*
//PLCYIN   DD DSN=ALB.DWH.PLCYMSTR.DAILY(+1),DISP=SHR
//ACTOUT   DD DSN=ALB.ACT.PLCYMSTR.COPY(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(50,10)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
